# Ultralytics YOLO 馃殌, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# 绌洪棽....
# Ultralytics YOLO 馃殌, AGPL-3.0 license
# 鐢ㄧ殑鏄?yolo11-ADown-Backbone-SOEP1EMA-SWC-DySample-fixed.yaml 鑷富鍏抽棴amp
# 璺?00杞锛岀湅鐪嬫晥鏋?
# Parameters
nc: 3 # number of classes
scales: # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, SWC, [256, 11, False, 0.25]]  # SWC
  - [-1, 1, ADown, [256]] # 3-P3/8
  - [-1, 2, SWC, [512, 9, False, 0.25]]
  - [-1, 1, ADown, [512]] # 5-P4/16
  - [-1, 2, SWC, [512, 7, True]]
  - [-1, 1, ADown, [1024]] # 7-P5/32
  - [-1, 2, SWC, [1024, 7, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, DySample, [2, 'lp']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, SWC, [512, 7, False]] # 13
  
  - [-1, 1, DySample, [2, 'lp']]
  - [2, 1, SPDConv, [256]]
  - [[-1, -2, 4], 1, Concat, [1]]
  - [-1, 1, FMKernel, []]
  - [-1, 2, EMA, [256, False]] # 18
  
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, SWC, [512, 7, False]]
  
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, SWC, [1024, 7, True]]
  
  - [[18, 21, 24], 1, Detect, [nc]]




